### 1.pandas

In [37]:
import pandas as pd
import numpy as np
import os
import datetime
import time

#### time and datetime

dir(datetime)
 'date',#日期
 'datetime',#日期和时间
 'datetime_CAPI',
 'time',#时间
 'timedelta',#差值
 'timezone',
 'tzinfo'

In [39]:
now=datetime.datetime.now()
now

datetime.datetime(2018, 3, 29, 20, 33, 3, 595613)

In [42]:
now.day,now.year,now.minute

(29, 2018, 33)

In [43]:
datetime.datetime(2011,7,11)-datetime.datetime(2004,2,3,3,15)

datetime.timedelta(2714, 74700)

In [50]:
datetime.timedelta(2)+datetime.date(2012,3,4)

datetime.date(2012, 3, 6)

In [54]:
str(datetime.date(2012,3,4))

'2012-03-04'

##### 解析时间

In [61]:
import dateutil

dir(dateutil)
 'easter',
 'parser',
 'relativedelta',
 'rrule',
 'tz',
 'zoneinfo'

In [67]:
dateutil.parser.parse('2011-11-1')

datetime.datetime(2011, 11, 1, 0, 0)

#### 1.1 构造时间序列

In [15]:
date_range=pd.Series(np.arange(10),index=pd.date_range('2012-10-9',periods=10))
date_range.head()

2012-10-09    0
2012-10-10    1
2012-10-11    2
2012-10-12    3
2012-10-13    4
Freq: D, dtype: int32

#### 时间序列的index

In [16]:
date_index=date_range.index.values
date_index[0]

numpy.datetime64('2012-10-09T00:00:00.000000000')

In [35]:
now=time.localtime(date_index[0].astype(datetime.date)/1e9)

##### 时间序列的转换

In [34]:
'{:4d}-{:0>2d}-{:0>2d}'.format(now[0],now[1],now[2])

'2012-10-09'

### 切片

In [83]:
s=date_range
s[:3]

2012-10-09    0
2012-10-10    1
2012-10-11    2
Freq: D, dtype: int32

In [85]:
s['2012-10-18']==s[9]

True

##### slice 包含收尾两端的

In [86]:
s['2012-10-9':'2012-10-12']

2012-10-09    0
2012-10-10    1
2012-10-11    2
2012-10-12    3
Freq: D, dtype: int32

### 花式索引

In [9]:
s[[0,1,5,2,3]]#也可以变成排序的方法。

2012-10-09    0
2012-10-10    1
2012-10-14    5
2012-10-11    2
2012-10-12    3
dtype: int32

### Series 同样具有字典的方法。

In [87]:
list(s.iteritems())

[(Timestamp('2012-10-09 00:00:00', freq='D'), 0),
 (Timestamp('2012-10-10 00:00:00', freq='D'), 1),
 (Timestamp('2012-10-11 00:00:00', freq='D'), 2),
 (Timestamp('2012-10-12 00:00:00', freq='D'), 3),
 (Timestamp('2012-10-13 00:00:00', freq='D'), 4),
 (Timestamp('2012-10-14 00:00:00', freq='D'), 5),
 (Timestamp('2012-10-15 00:00:00', freq='D'), 6),
 (Timestamp('2012-10-16 00:00:00', freq='D'), 7),
 (Timestamp('2012-10-17 00:00:00', freq='D'), 8),
 (Timestamp('2012-10-18 00:00:00', freq='D'), 9)]

#### pandas 计算会自动对齐标签，需要注意。

In [88]:
s[1:]+s[:-1]

2012-10-09     NaN
2012-10-10     2.0
2012-10-11     4.0
2012-10-12     6.0
2012-10-13     8.0
2012-10-14    10.0
2012-10-15    12.0
2012-10-16    14.0
2012-10-17    16.0
2012-10-18     NaN
Freq: D, dtype: float64

#### DataFrame 读取文件

In [90]:
pf=pd.DataFrame(np.random.rand(5,5),index=range(5),columns=list('ABCDE'))
pf

          A         B         C         D         E
0  0.846671  0.624665  0.663925  0.456030  0.078102
1  0.890030  0.871189  0.445950  0.138340  0.390659
2  0.219923  0.530622  0.003262  0.579310  0.505903
3  0.014065  0.847766  0.427819  0.470006  0.833238
4  0.318141  0.151818  0.383733  0.830689  0.304982

In [91]:
pf.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [94]:
#add a name to the columns 
pf.columns.name='doc'
pf

doc         A         B         C         D         E
0    0.846671  0.624665  0.663925  0.456030  0.078102
1    0.890030  0.871189  0.445950  0.138340  0.390659
2    0.219923  0.530622  0.003262  0.579310  0.505903
3    0.014065  0.847766  0.427819  0.470006  0.833238
4    0.318141  0.151818  0.383733  0.830689  0.304982

In [96]:
pf.index.names

FrozenList([None])

#### 字典到DataFrame各种类型的转换

In [98]:
dicte={i:list(range(i,i+5)) for i in range(3)}
pf2=pd.DataFrame(dicte,index=list('ABCDE'))
pf2

   0  1  2
A  0  1  2
B  1  2  3
C  2  3  4
D  3  4  5
E  4  5  6

In [99]:
pf2.index=list('12345')
pf2

   0  1  2
1  0  1  2
2  1  2  3
3  2  3  4
4  3  4  5
5  4  5  6

In [103]:
dicte

{0: [0, 1, 2, 3, 4], 1: [1, 2, 3, 4, 5], 2: [2, 3, 4, 5, 6]}

In [102]:
#orient 方向，把keyd当作index or columns
df3=pd.DataFrame.from_dict(dicte,orient='index')
df3

   0  1  2  3  4
0  0  1  2  3  4
1  1  2  3  4  5
2  2  3  4  5  6

In [104]:
dicte.items()

dict_items([(0, [0, 1, 2, 3, 4]), (1, [1, 2, 3, 4, 5]), (2, [2, 3, 4, 5, 6])])

In [108]:
#orient 方向，把keyd当作index or columns
df3=pd.DataFrame.from_items(dicte.items(),orient='columns')
df3

   0  1  2
0  0  1  2
1  1  2  3
2  2  3  4
3  3  4  5
4  4  5  6

In [119]:
df3.index=list('ABCDE')
df3.columns=list('xyz')
df4=df3.reset_index()
df4.to_dict(orient='records')

[{'index': 'A', 'x': 0, 'y': 1, 'z': 2},
 {'index': 'B', 'x': 1, 'y': 2, 'z': 3},
 {'index': 'C', 'x': 2, 'y': 3, 'z': 4},
 {'index': 'D', 'x': 3, 'y': 4, 'z': 5},
 {'index': 'E', 'x': 4, 'y': 5, 'z': 6}]

##### json records  与  json.loads 一样

In [130]:
import json
json.loads(df4.T.to_json()).values()

dict_values([{'index': 'A', 'x': 0, 'y': 1, 'z': 2}, {'index': 'B', 'x': 1, 'y': 2, 'z': 3}, {'index': 'C', 'x': 2, 'y': 3, 'z': 4}, {'index': 'D', 'x': 3, 'y': 4, 'z': 5}, {'index': 'E', 'x': 4, 'y': 5, 'z': 6}])

In [136]:
df3.to_dict(orient='dict')

{'x': {'A': 0, 'B': 1, 'C': 2, 'D': 3, 'E': 4},
 'y': {'A': 1, 'B': 2, 'C': 3, 'D': 4, 'E': 5},
 'z': {'A': 2, 'B': 3, 'C': 4, 'D': 5, 'E': 6}}

#### indxe 对象
index 对象是只读的。

In [137]:
df3.index,df3.index.values

(Index(['A', 'B', 'C', 'D', 'E'], dtype='object'),
 array(['A', 'B', 'C', 'D', 'E'], dtype=object))

#### rolling   移动窗口计算。

pd.rolling.apply()

#### Timestamp Period ,Timedelta,单个时间的表示。

In [150]:
now=pd.Timestamp.now()#now
now_shanghai=now.tz_localize('Asia/Shanghai')
now_tokyo=now_shanghai.tz_convert('Asia/Tokyo')
print('l o c a l:',now)
print('shang hai:',now_shanghai)
print('t o k yo :',now_tokyo)

l o c a l: 2018-03-29 20:57:04.822822
shang hai: 2018-03-29 20:57:04.822822+08:00
t o k yo : 2018-03-29 21:57:04.822822+09:00

In [163]:
type(now)

pandas._libs.tslib.Timestamp

In [158]:
now_shanghai.to_period('D')

Period('2018-03-29', 'D')

In [35]:
import pytz
pytz.common_timezones[:5]#timezone

['Africa/Abidjan',
 'Africa/Accra',
 'Africa/Addis_Ababa',
 'Africa/Algiers',
 'Africa/Asmara']

##### 获取当前的时间

In [164]:
now_day=pd.Period.now(freq='D')#
now_day

Period('2018-03-29', 'D')

In [165]:
now=pd.Timestamp.now()
now.to_period('D')

Period('2018-03-29', 'D')

In [166]:
now_day.year,now_day.dayofweek,now_day.hour

(2018, 3, 0)

## Timedelta

In [170]:
day=pd.Timestamp('2015-10-1')#someday
td=now-day#the distacne between the now and that day
td

Timedelta('910 days 21:00:19.239506')

In [171]:
pd.Timestamp('2017-7-7')+td

Timestamp('2020-01-03 21:00:19.239506')

In [41]:
td.days,td.seconds,td.microseconds#

(694, 34013, 382482)

###### pd.date_range

In [173]:
ts_index=pd.date_range('2015-01-1','2015-10-5',freq='W')
ts_index

DatetimeIndex(['2015-01-04', '2015-01-11', '2015-01-18', '2015-01-25',
               '2015-02-01', '2015-02-08', '2015-02-15', '2015-02-22',
               '2015-03-01', '2015-03-08', '2015-03-15', '2015-03-22',
               '2015-03-29', '2015-04-05', '2015-04-12', '2015-04-19',
               '2015-04-26', '2015-05-03', '2015-05-10', '2015-05-17',
               '2015-05-24', '2015-05-31', '2015-06-07', '2015-06-14',
               '2015-06-21', '2015-06-28', '2015-07-05', '2015-07-12',
               '2015-07-19', '2015-07-26', '2015-08-02', '2015-08-09',
               '2015-08-16', '2015-08-23', '2015-08-30', '2015-09-06',
               '2015-09-13', '2015-09-20', '2015-09-27', '2015-10-04'],
              dtype='datetime64[ns]', freq='W-SUN')

In [177]:
ts_index.to_period('M')

PeriodIndex(['2015-01', '2015-01', '2015-01', '2015-01', '2015-02', '2015-02',
             '2015-02', '2015-02', '2015-03', '2015-03', '2015-03', '2015-03',
             '2015-03', '2015-04', '2015-04', '2015-04', '2015-04', '2015-05',
             '2015-05', '2015-05', '2015-05', '2015-05', '2015-06', '2015-06',
             '2015-06', '2015-06', '2015-07', '2015-07', '2015-07', '2015-07',
             '2015-08', '2015-08', '2015-08', '2015-08', '2015-08', '2015-09',
             '2015-09', '2015-09', '2015-09', '2015-10'],
            dtype='period[M]', freq='M')

In [194]:
ts_index

DatetimeIndex(['2015-01-04', '2015-01-11', '2015-01-18', '2015-01-25',
               '2015-02-01', '2015-02-08', '2015-02-15', '2015-02-22',
               '2015-03-01', '2015-03-08', '2015-03-15', '2015-03-22',
               '2015-03-29', '2015-04-05', '2015-04-12', '2015-04-19',
               '2015-04-26', '2015-05-03', '2015-05-10', '2015-05-17',
               '2015-05-24', '2015-05-31', '2015-06-07', '2015-06-14',
               '2015-06-21', '2015-06-28', '2015-07-05', '2015-07-12',
               '2015-07-19', '2015-07-26', '2015-08-02', '2015-08-09',
               '2015-08-16', '2015-08-23', '2015-08-30', '2015-09-06',
               '2015-09-13', '2015-09-20', '2015-09-27', '2015-10-04'],
              dtype='datetime64[ns]', freq='W-SUN')

In [200]:
ts_index#.shift(1).to_period('M')

DatetimeIndex(['2015-01-04', '2015-01-11', '2015-01-18', '2015-01-25',
               '2015-02-01', '2015-02-08', '2015-02-15', '2015-02-22',
               '2015-03-01', '2015-03-08', '2015-03-15', '2015-03-22',
               '2015-03-29', '2015-04-05', '2015-04-12', '2015-04-19',
               '2015-04-26', '2015-05-03', '2015-05-10', '2015-05-17',
               '2015-05-24', '2015-05-31', '2015-06-07', '2015-06-14',
               '2015-06-21', '2015-06-28', '2015-07-05', '2015-07-12',
               '2015-07-19', '2015-07-26', '2015-08-02', '2015-08-09',
               '2015-08-16', '2015-08-23', '2015-08-30', '2015-09-06',
               '2015-09-13', '2015-09-20', '2015-09-27', '2015-10-04'],
              dtype='datetime64[ns]', freq='W-SUN')

In [199]:
#不懂
ts_index.shift(1,'M')

DatetimeIndex(['2015-01-31', '2015-01-31', '2015-01-31', '2015-01-31',
               '2015-02-28', '2015-02-28', '2015-02-28', '2015-02-28',
               '2015-03-31', '2015-03-31', '2015-03-31', '2015-03-31',
               '2015-03-31', '2015-04-30', '2015-04-30', '2015-04-30',
               '2015-04-30', '2015-05-31', '2015-05-31', '2015-05-31',
               '2015-05-31', '2015-06-30', '2015-06-30', '2015-06-30',
               '2015-06-30', '2015-06-30', '2015-07-31', '2015-07-31',
               '2015-07-31', '2015-07-31', '2015-08-31', '2015-08-31',
               '2015-08-31', '2015-08-31', '2015-08-31', '2015-09-30',
               '2015-09-30', '2015-09-30', '2015-09-30', '2015-10-31'],
              dtype='datetime64[ns]', freq=None)

In [202]:
ts_index.normalize()

DatetimeIndex(['2015-01-04', '2015-01-11', '2015-01-18', '2015-01-25',
               '2015-02-01', '2015-02-08', '2015-02-15', '2015-02-22',
               '2015-03-01', '2015-03-08', '2015-03-15', '2015-03-22',
               '2015-03-29', '2015-04-05', '2015-04-12', '2015-04-19',
               '2015-04-26', '2015-05-03', '2015-05-10', '2015-05-17',
               '2015-05-24', '2015-05-31', '2015-06-07', '2015-06-14',
               '2015-06-21', '2015-06-28', '2015-07-05', '2015-07-12',
               '2015-07-19', '2015-07-26', '2015-08-02', '2015-08-09',
               '2015-08-16', '2015-08-23', '2015-08-30', '2015-09-06',
               '2015-09-13', '2015-09-20', '2015-09-27', '2015-10-04'],
              dtype='datetime64[ns]', freq='W-SUN')

#### 时间序列当作索引

In [203]:
ts=pd.Series(range(5),index=pd.date_range('2015-5-5-10:10:10.123456',periods=5,freq='H'))
ts

2015-05-05 10:10:10.123456    0
2015-05-05 11:10:10.123456    1
2015-05-05 12:10:10.123456    2
2015-05-05 13:10:10.123456    3
2015-05-05 14:10:10.123456    4
Freq: H, dtype: int32

#### function

In [204]:
ts.between_time('12:00','14:00')#choose time between  the clip

2015-05-05 12:10:10.123456    2
2015-05-05 13:10:10.123456    3
Freq: H, dtype: int32

##### shift

In [205]:
#change the time due to means
ts.tshift(1,freq='D')

2015-05-06 10:10:10.123456    0
2015-05-06 11:10:10.123456    1
2015-05-06 12:10:10.123456    2
2015-05-06 13:10:10.123456    3
2015-05-06 14:10:10.123456    4
Freq: H, dtype: int32

In [206]:
pd.Series(pd.date_range('2015-5-5-10:10:10.123456',periods=5,freq='H'))#the time consider as the values

0   2015-05-05 10:10:10.123456
1   2015-05-05 11:10:10.123456
2   2015-05-05 12:10:10.123456
3   2015-05-05 13:10:10.123456
4   2015-05-05 14:10:10.123456
dtype: datetime64[ns]

#### about NaN

In [208]:
np.random.seed(41)
df=pd.DataFrame(np.random.randint(0,10,(10,3)),columns=list('ABC'))
df.head(2)

   A  B  C
0  0  3  2
1  0  1  3

In [209]:
df.A+=10
df.head(2)

    A  B  C
0  10  3  2
1  10  1  3

In [210]:
#False will change to be nan
df_nan=df.where(df>2)
df_nan.head()

    A    B    C
0  10  3.0  NaN
1  10  NaN  3.0
2  19  7.0  5.0
3  18  3.0  3.0
4  12  6.0  NaN

In [212]:
df_nan.isnull().head()#print is whther is nan

       A      B      C
0  False  False   True
1  False   True  False
2  False  False  False
3  False  False  False
4  False  False   True

In [214]:
#useful num 
df_nan.count()

A    10
B     8
C     5
dtype: int64

## dropna

In [215]:
print(df_nan.dropna(),'\n\n',df_nan.dropna(thresh=2))

    A    B    C
2  19  7.0  5.0
3  18  3.0  3.0
5  14  6.0  9.0
6  13  8.0  4.0

     A    B    C
0  10  3.0  NaN
1  10  NaN  3.0
2  19  7.0  5.0
3  18  3.0  3.0
4  12  6.0  NaN
5  14  6.0  9.0
6  13  8.0  4.0
7  17  6.0  NaN
9  15  3.0  NaN

In [57]:
df_nan.ffill().head()#forehead fill,

    A    B    C
0  10  3.0  NaN
1  10  3.0  3.0
2  19  7.0  5.0
3  18  3.0  3.0
4  12  6.0  3.0

In [58]:
df_nan.bfill().head()

    A    B    C
0  10  3.0  3.0
1  10  7.0  3.0
2  19  7.0  5.0
3  18  3.0  3.0
4  12  6.0  9.0

##### df_nan.interpolate 插值

df_nan.interpolate
method:   'linear', 'time', 'index', 'values', 'nearest', 'zero',
       'slinear', 'quadratic', 'cubic', 'barycentric', 'krogh',
       'polynomial', 'spline', 'piecewise_polynomial',
       'from_derivatives', 'pchip', 'akima'}

### fiilna,skipna

In [61]:
df_nan.fillna({'B':99}).fillna(0).head()

    A     B    C
0  10   3.0  0.0
1  10  99.0  3.0
2  19   7.0  5.0
3  18   3.0  3.0
4  12   6.0  0.0

## df.combine_first(other) 用other填充df

In [220]:
df=pd.DataFrame(np.random.randn(4,2),columns=list('BC'))
df

          B         C
0 -1.858490 -1.370624
1 -0.330106 -1.515290
2  1.200060 -1.822619
3  0.269385 -0.446424

In [221]:
#把0，1，2，3，行，BC列的数据替换掉了
df_nan.combine_first(df)

    A         B         C
0  10  3.000000 -1.370624
1  10 -0.330106  3.000000
2  19  7.000000  5.000000
3  18  3.000000  3.000000
4  12  6.000000       NaN
5  14  6.000000  9.000000
6  13  8.000000  4.000000
7  17  6.000000       NaN
8  15       NaN       NaN
9  15  3.000000       NaN

## 合并

concat 链接两个dataFrame
set_index,
stack #将列索引转换成行索引
reorder_levels
sort_index# 对索引排序
melt
drop
reset_index
unstack
swqplevel
pivot
assign

In [222]:
df

          B         C
0 -1.858490 -1.370624
1 -0.330106 -1.515290
2  1.200060 -1.822619
3  0.269385 -0.446424

In [223]:
df.stack()

0  B   -1.858490
   C   -1.370624
1  B   -0.330106
   C   -1.515290
2  B    1.200060
   C   -1.822619
3  B    0.269385
   C   -0.446424
dtype: float64

In [224]:
df.append(df).reset_index()

   index         B         C
0      0 -1.858490 -1.370624
1      1 -0.330106 -1.515290
2      2  1.200060 -1.822619
3      3  0.269385 -0.446424
4      0 -1.858490 -1.370624
5      1 -0.330106 -1.515290
6      2  1.200060 -1.822619
7      3  0.269385 -0.446424

In [228]:
#axis=1 drop columns ,axis=0 drop row
df.drop('B',axis=1)

          C
0 -1.370624
1 -1.515290
2 -1.822619
3 -0.446424

In [229]:
#concat 不处理标签
pd.concat([df,df],axis=1)

          B         C         B         C
0 -1.858490 -1.370624 -1.858490 -1.370624
1 -0.330106 -1.515290 -0.330106 -1.515290
2  1.200060 -1.822619  1.200060 -1.822619
3  0.269385 -0.446424  0.269385 -0.446424

In [230]:
d=df.stack()
d.index

MultiIndex(levels=[[0, 1, 2, 3], ['B', 'C']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]])

In [231]:
d2=d.swaplevel(0,1)
d2.index

MultiIndex(levels=[['B', 'C'], [0, 1, 2, 3]],
           labels=[[0, 1, 0, 1, 0, 1, 0, 1], [0, 0, 1, 1, 2, 2, 3, 3]])

#### groupby

In [232]:
df=pd.DataFrame(np.random.randint(0,5,(5,5)),columns=list('ABCDE'))
dfg=df.groupby('E')
df

   A  B  C  D  E
0  2  4  3  0  4
1  2  2  1  4  1
2  1  2  4  4  4
3  3  0  3  2  2
4  0  2  2  2  0

In [238]:
dfg2=df.groupby(['E','A'])
dfg2.count()

     B  C  D
E A
0 0  1  1  1
1 2  1  1  1
2 3  1  1  1
4 1  1  1  1
  2  1  1  1

In [239]:
dfg2.count().index

MultiIndex(levels=[[0, 1, 2, 4], [0, 1, 2, 3]],
           labels=[[0, 1, 2, 3, 3], [0, 2, 3, 1, 2]],
           names=['E', 'A'])

In [242]:
dfg.keys,dfg2.keys

('E', ['E', 'A'])

In [243]:
dfg2.A.mean()

E  A
0  0    0
1  2    2
2  3    3
4  1    1
   2    2
Name: A, dtype: int32

In [244]:
mud=dfg2.count()
mud

     B  C  D
E A
0 0  1  1  1
1 2  1  1  1
2 3  1  1  1
4 1  1  1  1
  2  1  1  1

## 多级标签可以用loc读取，也可以设置新的值

In [248]:
#mud.index.set_levels=[[0, 1, 2, 4], [0, 1, 2, 7]]
mud

     B  C  D
E A
0 0  1  1  1
1 2  1  1  1
2 3  1  1  1
4 1  1  1  1
  2  1  1  1

In [250]:
mud.loc[[4,1],['B','C']]#对第一级标题进行索引

     B  C
E A
1 2  1  1
4 1  1  1
  2  1  1

In [251]:
mud.loc[np.s_[4,1],['B','C']]#对第一级标题和第二级标题进行索引，用到 np.s_ 切片功能

B    1
C    1
Name: (4, 1), dtype: int64

#### groupby 支持迭代，像字典一样,key就是行的名字

In [254]:
for key,df in dfg:
    print(key,df.shape)

0 (1, 5)
1 (1, 5)
2 (1, 5)
4 (2, 5)

In [253]:
for key,df in dfg2:
    print(key,'\t',df.shape)

(0, 0) 	 (1, 5)
(1, 2) 	 (1, 5)
(2, 3) 	 (1, 5)
(4, 1) 	 (1, 5)
(4, 2) 	 (1, 5)

#### get_group() ,

In [258]:
dfg.get_group(1)

   A  B  C  D  E
1  2  2  1  4  1

In [261]:
dfg2.get_group((4,1))#多级索引必须用一个tuple

   A  B  C  D  E
2  1  2  4  4  4

#### transform() 转换

In [267]:
dfa=df.groupby('A')
dfa.transform(lambda s:s)

   B  C  D  E
0  2  2  0  2
1  0  0  2  1
2  0  4  1  1
3  2  2  1  1
4  1  0  1  1

In [268]:
dfa.transform(lambda s:s-s.mean())

     B    C    D    E
0  0.0  0.0 -0.5  0.5
1 -0.5  0.0  0.5  0.0
2  0.0  0.0  0.0  0.0
3  0.0  0.0  0.5 -0.5
4  0.5  0.0 -0.5  0.0

In [269]:
dfa.count()

   B  C  D  E
A
1  2  2  2  2
2  2  2  2  2
4  1  1  1  1

## fliter()

In [270]:
dfa.filter(lambda df: df.C.max()>1)

   A  B  C  D  E
0  1  2  2  0  2
2  4  0  4  1  1
3  1  2  2  1  1